app/views/home/index.html.erb

          <div class="flex items-center gap-1">
            <% if @current_order.order_items.any? %>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
SELECT 1 AS one FROM "order_items" WHERE "order_items"."order_id" = ? LIMIT ?  [["order_id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders"

<%= {
  orderId: @current_order&.id,
  orderStatus: @current_order&.status || 0,
  orderTotal: @current_order&.total || 0,
  cliente: @current_order&.cliente || '',
  mesero: @current_order&.mesero || '',
  tipoServicio: @current_order&.tipo_servicio || 'mesa',
  createdAt: @current_order&.created_at&.strftime("%d/%m/%y %H:%M") || '',
  items: @current_order&.order_items&.includes(:product)&.map { |item|
---
SELECT "orders".* FROM "orders" WHERE "orders"."status" = ? ORDER BY "orders"."created_at" DESC  [["status", 0]]