app/controllers/home_controller.rb

  def index
    valor = 0
    Order.where("id >= 62").each do |order|
      valor += order.order_items.sum(:precio_unitario)
    end
    puts "Total de valor de los productos: #{valor}"
    @orders = Order.where(status: 0).order(created_at: :desc)
    @closed_orders = Order.where(status: 1).order(created_at: :desc).limit(10)
    @new_order_id = params[:order_id].presence || params[:id].presence
    @current_order = Order.find(@new_order_id) if @new_order_id.present?
    @products = Product.where(activo: true).order(:nombre) if @current_order.present?
    @order_items = @current_order.order_items.includes(:product) if @current_order.present?
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
SELECT "orders".* FROM "orders"
SELECT "orders".* FROM "orders" WHERE "orders"."status" = ? ORDER BY "orders"."created_at" DESC  [["status", 0]]
SELECT "products".* FROM "products" WHERE "products"."activo" = ? ORDER BY "products"."nombre" ASC  [["activo", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ?  [["id", 1]]
SELECT 1 AS one FROM "order_items" WHERE "order_items"."order_id" = ? LIMIT ?  [["order_id", 1], ["LIMIT", 1]]