app/controllers/orders_controller.rb

INSERT INTO "orders" ("cliente", "mesero", "comentario", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)  [["cliente", "Prueba2"], ["mesero", "mesero2"], ["comentario", "asd"], ["created_at", "2026-01-20 05:43:18.253838"], ["updated_at", "2026-01-20 05:43:18.253838"], ["status", "0"]]
---
  def create
    Rails.logger.debug "Params recibidos: #{params.inspect}"
    @order = Order.new(order_params)
    Rails.logger.debug "Order creado: #{@order.inspect}"

    if @order.save

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 14]]
SELECT 1 AS one FROM "order_items" WHERE "order_items"."order_id" = ? LIMIT ?  [["order_id", 16], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."product_id" = ? LIMIT ?  [["order_id", 41], ["product_id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "updated_at" = ?, "status" = ? WHERE "orders"."id" = ?  [["updated_at", "2026-01-27 02:13:41.813141"], ["status", 1], ["id", 1]]
UPDATE "order_items" SET "cantidad" = ?, "updated_at" = ? WHERE "order_items"."id" = ?  [["cantidad", 2], ["updated_at", "2026-02-05 17:25:02.371201"], ["id", 14]]
INSERT INTO "order_items" ("order_id", "product_id", "cantidad", "precio_unitario", "created_at", "updated_at", "comentario") VALUES (?, ?, ?, ?, ?, ?, ?)  [["order_id", 41], ["product_id", 1], ["cantidad", 1], ["precio_unitario", 24500.0], ["created_at", "2026-01-31 22:07:54.561096"], ["updated_at", "2026-01-31 22:07:54.561096"], ["comentario", ""]]
---
  def confirm_items
    @order = Order.find(params[:id])

    # Verificar que el pedido no esté cerrado
    if @order.status != 0
      redirect_to pedido_path(@order.id), alert: 'No se pueden agregar productos a un pedido cerrado.'
      return
    end

    # Recibir array de productos con comentarios
    if params[:order_items].present?
      params[:order_items].each do |key, item_params|
        product = Product.find(item_params[:product_id])
        cantidad = item_params[:cantidad].to_i
        cantidad = 1 if cantidad < 1
        comentario = item_params[:comentario].to_s.strip

        # Buscar si ya existe el producto en la orden
        order_item = @order.order_items.find_by(product_id: product.id)

        if order_item
          # Si existe, actualizar cantidad y comentario
          new_comentario = if order_item.comentario.present? && comentario.present?
            "#{order_item.comentario}; #{comentario}"
          elsif comentario.present?
            comentario
          else
            order_item.comentario
          end

          order_item.update(
            cantidad: order_item.cantidad + cantidad,
            comentario: new_comentario
          )
        else
          # Si no existe, crear nuevo item
          @order.order_items.create(
            product: product,
            cantidad: cantidad,
            precio_unitario: product.precio,
            comentario: comentario
          )

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]
UPDATE "orders" SET "updated_at" = ?, "status" = ?, "monto_pagado" = ?, "tipo_pago" = ?, "vuelto" = ? WHERE "orders"."id" = ?  [["updated_at", "2026-02-05 17:36:22.757531"], ["status", 1], ["monto_pagado", 49000.0], ["tipo_pago", "efectivo"], ["vuelto", 0.0], ["id", 42]]
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
  def close_order
    @order = Order.find(params[:id])

    monto_pagado = params[:monto_pagado].to_f
    tipo_pago = params[:tipo_pago]
    vuelto = params[:vuelto].to_f

    if @order.update(
      status: 1,
      monto_pagado: monto_pagado,
      tipo_pago: tipo_pago,
      vuelto: vuelto
    )
      # Transmitir actualización en tiempo real
      ActionCable.server.broadcast("orders_channel", {
        type: "order_closed",
        order: {
          id: @order.id,
          status: @order.status,
          total: @order.total
        }
      })
      redirect_to root_path, notice: 'Pedido cerrado exitosamente.'
    else
      redirect_to root_path, alert: "Error al cerrar el pedido: #{@order.errors.full_messages.join(', ')}"

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
UPDATE "orders" SET "updated_at" = ?, "tipo_servicio" = ? WHERE "orders"."id" = ?  [["updated_at", "2026-01-31 21:42:17.340831"], ["tipo_servicio", "domicilio"], ["id", 19]]
---
  def update_servicio
    @order = Order.find(params[:id])
    if @order.status != 0
      redirect_to pedido_path(@order.id), alert: 'No se puede cambiar el tipo de servicio en un pedido cerrado.'
      return
    end
    tipo = params[:tipo_servicio].to_s
    unless %w[mesa llevar domicilio].include?(tipo)
      redirect_to pedido_path(@order.id), alert: 'Tipo de servicio no válido.'
      return
    end
    if @order.update(tipo_servicio: tipo)