app/controllers/orders_controller.rb

SELECT 1 AS one FROM "order_items" WHERE "order_items"."order_id" = ? LIMIT ?  [["order_id", 12], ["LIMIT", 1]]
---
  def create
    Rails.logger.debug "Params recibidos: #{params.inspect}"
    @order = Order.new(order_params)

    ActiveRecord::Base.transaction do
      @order.save!
      apply_order_items(@order, params[:order_items]) if params[:order_items].present?

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def confirm_items
    @order = Order.find(params[:id])

    # Verificar que el pedido esté abierto
    unless @order.open?
      redirect_to pedido_path(@order.id), alert: 'No se pueden agregar productos a un pedido cerrado o cancelado.'
      return
    end

    # Tipo de servicio: viaja en el mismo formulario que los productos, así
    # se guarda junto con ellos al confirmar (sin recargar ni perder la
    # selección de productos aún no confirmados).
    servicio_actualizado = false
    tipo_servicio = params[:tipo_servicio].to_s
    if %w[mesa llevar domicilio].include?(tipo_servicio) && tipo_servicio != @order.tipo_servicio