app/controllers/products_controller.rb

  def index
    @products = Product.with_attached_foto.order(created_at: :desc)
---
SELECT "products".* FROM "products" ORDER BY "products"."created_at" DESC

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("nombre", "descripcion", "precio", "categoria", "activo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)